package com.record.utils;

public class Festival {
    public String[] lFtv = new String[]{"春节", "元宵节", "端午节", "七夕", "中秋节", "重阳节", "除夕", "腊八节", "小年", "苗族妹妹节", "苗族龙船节", "彝族火把节", "寒食", "中元节-鬼节", "苗年", "下元节", "测试数据"};
    public String[] sFtv = new String[]{"元旦", "中国第十三亿人口日", "国际海关日", "世界湿地日", "国际声援南非日", "国际气象节", "情人节", "中国12亿人口日", "反对殖民制度斗争日 国际母语日", "第三世界青年日", "世界居住青年调查日", "国际海豹日", "全国爱耳日", "中国青年志愿者服务日 向雷锋同志学习纪念日", "世界青光眼日", "国际劳动妇女节", "植树节 孙中山逝世纪念日", "国际警察日", "国际消费者权益日", "手拉手情系贫困小伙伴全国统一行动日", "中国国医节", "世界林业节", "愚人节", "国际儿童图书日", "世界卫生日", "全国企业家活动日", "世界地球日", "世界法律日 世界图书和版权日", "世界青年反对殖民主义日 亚非新闻工作者日", "全国儿童预防接种宣传日", "世界知识产权日", "联谊城日", "全国交通安全反思日", "劳动节", "世界新闻自由日", "中国五四青年节 五四运动纪念日 科技传播日", "世界红十字日 世界微笑日", "国际护士节", "全国碘缺乏病防治日", "世界电信日", "国际博物馆日", "全国母乳喂养宣传日 中国学生营养日", "生物多样性国际日", "世界向人体条件挑战日", "‘五卅’反对帝国主义运动纪念日", "世界无烟日", "儿童节", "世界环境日", "全国爱眼日", "全国人口日", "世界防止沙漠化和干旱日", "世界难民日", "中国儿童慈善活动日", "国际奥林匹克日 世界手球日", "全国土地日", "国际禁毒日 国际宪章日", "世界青年联欢日", "建党节 香港回归纪念日 国际建筑日 亚洲三十亿人口日", "国际体育记者日", "中国人民抗日战争纪念日", "世界人口日", "世界语（言）创立日", "非洲妇女日", "中国人民解放军建军节", "国际电影节", "中国男子节（爸爸节）", "国际左撇子节", "日本正式宣布无条件投降日", "全国律师咨询日", "中国抗日战争胜利纪念日", "国际新闻工作者日 世界扫盲日", "教师节", "世界清洁地球日", "国际臭氧层保护日", "‘九一八’事件纪念日（中国国耻日）", "全国爱牙日", "国际和平日", "世界旅游日", "国庆节", "世界动物日", "世界邮政日", "辛亥革命纪念日 世界精神卫生日", "声援南非政治犯日", "中国少年先锋队诞辰日", "世界标准日", "国际盲人节", "世界粮食日", "世界消除贫困日", "世界传统医药日", "联合国日 世界发展信息日", "世界男性健康日", "世界勤俭日", "中国记者节", "中国消防宣传日", "世界青年节", "世界糖尿病日", "国际大学生节", "世界电视日 世界问候日", "世界艾滋病日", "废除一切形式奴役世界日", "世界残疾人日", "中国法制宣传日", "促进经济和社会发展资源人员国际日 世界弱能人士日", "国际民航日", "一二九运动纪念日 国际反腐败日 世界足球日", "世界人权日", "世界防治哮喘日", "西安事变纪念日", "南京大屠杀纪念日", "世界强化免疫日", "澳门回归纪念日", "国际篮球日", "平安夜", "圣诞节", "节礼节", "生物多样性国际日", "光棍节"};
    String[] wFtv = new String[]{"0110 黑人日", "0150 世界麻风日", "0520 国际母亲节", "0530 全国助残日", "0630 父亲节", "0911 劳动节", "0932 国际和平日", "0940 国际聋人节 世界儿童日", "0950 世界海事日", "1011 国际住房日", "1013 国际减轻自然灾害日(减灾日)", "1144 感恩节"};

    public String showSFtv(int month, int day) {
        if (month == 1 && day == 1) {
            return this.sFtv[0];
        }
        if (month == 2 && day == 14) {
            return this.sFtv[6];
        }
        if (month == 4 && day == 1) {
            return this.sFtv[22];
        }
        if (month == 5 && day == 1) {
            return this.sFtv[33];
        }
        if (month == 6 && day == 1) {
            return this.sFtv[46];
        }
        if (month == 9 && day == 10) {
            return this.sFtv[71];
        }
        if (month == 10 && day == 1) {
            return this.sFtv[78];
        }
        if (month == 12 && day == 24) {
            return this.sFtv[112];
        }
        if (month == 12 && day == 25) {
            return this.sFtv[113];
        }
        return "";
    }

    public String showLFtv(int month, int day, int dayOfmonth) {
        if (month == 1 && day == 1) {
            return this.lFtv[0];
        }
        if (month == 1 && day == 15) {
            return this.lFtv[1];
        }
        if (month == 5 && day == 5) {
            return this.lFtv[2];
        }
        if (month == 7 && day == 7) {
            return this.lFtv[3];
        }
        if (month == 8 && day == 15) {
            return this.lFtv[4];
        }
        if (month == 9 && day == 9) {
            return this.lFtv[5];
        }
        if (month == 12 && day == 29 && dayOfmonth == 29) {
            return this.lFtv[6];
        }
        if (month == 12 && day == 30 && dayOfmonth == 30) {
            return this.lFtv[6];
        }
        if (month == 12 && day == 8) {
            return this.lFtv[7];
        }
        return (month == 12 && day == 23) ? this.lFtv[8] : "";
    }
}
